controllers/ClaController.php

INSERT INTO `cla` (`secao_idsecao`, `nome`) VALUES (4, 'Clã P. Cavaleiros Templários')
SELECT EXISTS(SELECT * FROM `secao` WHERE `secao`.`idsecao`='4')
SELECT * FROM `secao`
---
    public function actionCreate()
    {
        $model = new Cla();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->secao_idsecao]);
        }

        $arraySecao = ArrayHelper::map(Secao::find()->all(), 'idsecao', 'nome');

SELECT EXISTS(SELECT * FROM `secao` WHERE `secao`.`idsecao`='4')
SELECT * FROM `secao`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->secao_idsecao]);
        }

        $arraySecao = ArrayHelper::map(Secao::find()->all(), 'idsecao', 'nome');