controllers/PatrulhaController.php

SELECT * FROM `tropa`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->idpatrulha]);
        }

        $arrayTropa = ArrayHelper::map(Tropa::find()->all(), 'secao_idsecao', 'nome');