controllers/TropaController.php

SELECT * FROM `secao`
---
    public function actionCreate()
    {
        $model = new Tropa();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->secao_idsecao]);
        }

        $arraySecao = ArrayHelper::map(Secao::find()->all(), 'idsecao', 'nome');

SELECT EXISTS(SELECT * FROM `secao` WHERE `secao`.`idsecao`='2')
SELECT * FROM `secao`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->secao_idsecao]);
        }

        $arraySecao = ArrayHelper::map(Secao::find()->all(), 'idsecao', 'nome');